Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Once the matching Connector is found, a control interface (such as IAudioVolumeLevel or IAudioMute) is retrieved by querying each Subunit on that specific branch of the graph, starting nearest the Connector.
ja: 一致する Connector が見つかると、Connector に最も近いところから、グラフのその特定のブランチ上の各 Subunit にクエリを実行して、コントロールインターフェース（IAudioVolumeLevel や IAudioMute など）を検索する。

source: Once the menu is destroyed, the operating system may reassign the handle value to any menus subsequently created by the script or any other program.
ja: メニューが破壊されると、オペレーティングシステムは、スクリプトまたは他のプログラムによってその後に作成されたすべてのメニューにハンドル値を再割り当てすることができます。

source: Once you have AutoHotkey installed, you will probably want it to do stuff.
ja: AutoHotkeyをインストールしたら、おそらくいろいろなことをさせたくなるでしょう。

source: One benefit of omitting the asterisk is that StartingFolder is initially shown in a tree-expanded state, which may save the user from having to click the first plus sign.
ja: アスタリスクを省略した場合の利点として、StartingFolderが最初にツリー状に展開された状態で表示されるため、ユーザーが最初のプラス記号をクリックする手間が省ける場合があります。

source: One can also create a "While" or "Do...While/Until" loop by making the first or last statement of the loop's body an IF statement that conditionally issues the Break statement, but the use of While or Loop...Until is usually preferred.
ja: ループ本体の最初か最後の文を、条件付きでBreak文を発行するIF文にすることで、「While」または「Do...While/Until」ループを作ることもできますが、通常はWhileまたはLoop...Untilを使うことが好ましいです。

source: One can also create a "While" or "Do...While/Until" loop by making the first or last statement of the loop's body an IF statement that conditionally issues the break statement, but the use of While or Loop...Until is usually preferred.
ja: ループ本体の最初か最後の文を、条件付きでbreak文を発行するIF文にすることで、「While」または「Do...While/Until」ループを作ることもできますが、通常はWhileまたはLoop...Untilを使うことが好ましいです。

source: One can store this object in a variable, or use GuiObj["Name"] or GuiCtrlFromHwnd to retrieve the object.
ja: このオブジェクトを変数に格納したり、GuiObj["Name"]やGuiCtrlFromHwndを使ってオブジェクトを取得することができます。

source: One can store this object in a variable, or use GuiObj["Name"] or GuiCtrlFromHwnd(hwnd) to retrieve the object.
ja: このオブジェクトを変数に格納したり、GuiObj["Name"]やGuiCtrlFromHwnd(hwnd)を使ってオブジェクトを取得することができます。

source: One character is generally reserved for a null terminator, leaving 259 characters for the actual path.
ja: 一般的に1文字はヌルターミネーターとして予約され、259文字が実際のパスに残される。

source: One common suggestion is to upload the file to an online service such as virustotal or Jotti and see what other antivirus programs have to say.
ja: よくある提案として、virustotalや Jottiなどのオンラインサービスにファイルをアップロードして、他のアンチウイルスプログラムの意見を聞いてみるというものがあります。

source: One common use for hotkeys is to start and stop a repeating action, such as a series of keystrokes or mouse clicks.
ja: ホットキーの一般的な使い方として、一連のキー操作やマウスクリックなど、繰り返しの動作を開始したり停止したりすることが挙げられます。

source: One example of a debugger is DebugView, which is free and available at microsoft.com.
ja: デバッガの一例として、DebugViewがあり、microsoft.comで無償配布されています。

source: One exception is that DllCall calls functions outside of the program; in those cases, it may be necessary to explicitly pass the buffer size to the function.
ja: 例外として、DllCallがプログラム外の関数を呼び出す場合があります。その場合は、バッファサイズを関数に明示的に渡す必要がある場合があります。

source: One function may be defined inside another.
ja: ある関数は、別の関数の内部で定義することができます。

source: One of <, <=, >, >= or = immediately followed by an optional letter "v" and a version number.
ja: <,<=,>,>=,=のいずれかに、オプションの文字「v」とバージョン番号がすぐに続きます。

source: One of AutoHotkey's strengths is the ease with which scripts can automate other programs and perform many other common tasks by simply calling a few functions.
ja: AutoHotkeyの強みの一つは、スクリプトがいくつかの関数を呼び出すだけで、他のプログラムを自動化したり、その他多くの一般的なタスクを実行したりすることができる手軽さです。

source: One of the 16 primary HTML color names, a hexadecimal RGB color string (the 0x prefix is optional), or a pure numeric RGB color value.
ja: 16種類のHTMLカラー名、16進数のRGBカラー文字列（0x接頭辞はオプション）、または純粋な数値のRGBカラー値のいずれか1つ。

source: One of the EndKeys was pressed to terminate the Input.
ja: EndKeyのいずれかが押され、入力が終了。

source: One of the ListView's column headers is clicked.
ja: ListViewのカラムヘッダーの1つがクリックされました。

source: One of the easiest and most useful things AutoHotkey can do is allow you to create keyboard shortcuts (hotkeys) that launch programs.
ja: AutoHotkeyの最も簡単で便利な機能の1つは、プログラムを起動するキーボードショートカット（ホットキー）を作成することができることです。

source: One of the easiest and most useful things AutoHotkey can do is allow you to create keyboard shortcuts (hotkeys) that manipulate windows.
ja: AutoHotkeyの最も簡単で便利な機能の1つは、ウィンドウを操作するキーボードショートカット（ホットキー）を作成することができることです。

source: One of the following exceptions may be thrown if the hotkey is invalid or could not be created:
ja: ホットキーが無効であったり、作成できなかったりすると、以下のいずれかの例外が発生することがあります：

source: One of the following exceptions may be thrown on failure:
ja: 失敗すると以下の例外のいずれかがスローされる：

source: One of the following may also be present:
ja: また、以下のいずれかが存在する場合があります：

source: One of the following mutually-exclusive strings sets the button choices:
ja: 以下の互いに排他的な文字列のいずれかが、ボタンの選択肢を設定します：

source: One of the following mutually-exclusive strings sets the button choices: OK, OKCancel, AbortRetryIgnore, YesNoCancel, YesNo, RetryCancel, CancelTryAgainContinue, or just the initials separated by slashes (o/c, y/n, etc.), or just the initials without slashes.
ja: 以下の互いに排他的な文字列のいずれかが、ボタンの選択肢を設定します：OK、OKCancel、AbortRetryIgnore、YesNoCancel、YesNo、RetryCancel、CancelTryAgainContinue、またはスラッシュで区切ったイニシャルのみ（o/c、y/nなど）、またはスラッシュなしのイニシャルのみです。

source: One of the following numbers:
ja: 以下の番号のいずれか1つ：

source: One of the following strings:
ja: 以下の文字列のいずれか1つ：

source: One of the following strings: UInt, Int, Int64, Short, UShort, Char, UChar, Double, Float, Ptr or UPtr
ja: 以下の文字列のいずれか1つ：UInt、Int、Int64、Short、UShort、Char、UChar、Double、Float、PtrまたはUPtr

source: One of the following strings: UInt, UInt64, Int, Int64, Short, UShort, Char, UChar, Double, Float, Ptr or UPtr
ja: 以下の文字列のいずれか1つ：UInt、UInt64、Int、Int64、Short、UShort、Char、UChar、Double、Float、PtrまたはUPtr

source: One of the following two workarounds can be used:
ja: 以下の2つの回避策のいずれかを使用することができる：

source: One of the following values (defaults to 0 if omitted):
ja: 以下の値のいずれか（省略時は0をデフォルトとします）：

source: One of the following values:
ja: 以下のいずれかの値：

source: One of the following words indicating how the input box was closed:
ja: 入力ボックスがどのように閉じられたかを示す次のいずれかの単語：

source: One of the following words to restrict the type of executable (EXE) which can run the script:
ja: スクリプトを実行できる実行ファイル（EXE）の種類を制限するために、次のいずれかの単語を使用します。

source: One of the following words to restrict the type of executable (EXE) which can run the script: "32-bit", "64-bit".
ja: スクリプトを実行できる実行ファイル（EXE）の種類を制限するために、次のいずれかの単語を使用します：「32-bit」、「64-bit」。

source: One of the following words:
ja: 次のいずれかの言葉：

source: One of the following:
ja: 以下のいずれか：

source: One of the most convenient ways to play back a macro is to assign it to a hotkey or hotstring.
ja: マクロを再生する最も便利な方法のひとつは、マクロをホットキーまたはホットストリングに割り当てることです。

source: One of the script's menus is being displayed (such as the tray icon menu or a menu bar).
ja: スクリプトのメニューのいずれかが表示されている（トレイアイコンメニューやメニューバーなど）。

source: One or more numeric options may also be included in the string.
ja: また、1つ以上の数値オプションを文字列に含めることができます。

source: One or more of the following single-character options (spaces and tabs are ignored).
ja: 以下の1文字オプションのうち1つ以上（スペースとタブは無視されます）。

source: One or more references to output variables for the enumerator to assign values.
ja: 列挙者が値を代入するための出力変数への1つ以上のリファレンス。

source: One or more values to insert.
ja: 挿入する1つまたは複数の値。

source: One possible work-around is to make the window briefly always-on-top, then turn off always-on-top.
ja: 回避策としては、ウィンドウを一時的に常に表示させた後にそれを解除することが考えられます。

source: One possible work-around is to make the window briefly always-on-top via WinSetAlwaysOnTop, then turn off always-on-top.
ja: 回避策として考えられるのは、WinSetAlwaysOnTopでウィンドウを一時的に常時トップにし、その後常時トップをオフにすることだ。

source: One strategy for dealing with this is to avoid direct comparison, instead comparing the difference.
ja: その対策として、直接の比較を避け、代わりに違いを比較することがあります。

source: One such case is when a script's hotkeys for various actions are configurable via an INI file.
ja: 例えば、スクリプトのホットキーで様々なアクションを行う場合、INIファイルで設定することが可能です。

source: One use for this is to identify or operate on the window after the function times out.
ja: この用途のひとつは、ファンクションがタイムアウトした後にウィンドウを特定したり操作したりすることである。

source: One way to do this is to have it queue up a future thread by posting to its own script a monitored message number greater than 0x0311.
ja: 一つの方法として、0x0311より大きい監視メッセージ番号を自身のスクリプトに投稿することで、未来のスレッドをキューに入れることができます。

source: One way to extract a clipping is to:
ja: クリッピングを抽出する方法の1つです：

source: One way to get a list of lines into a variable is to load an entire file via FileRead.
ja: 行のリストを変数に取り込む1つの方法は、FileReadでファイル全体を読み込むことである。

source: One way to prevent this is to add a tilde prefix (e.g. ~LControl up::)
ja: これを防ぐ一つの方法は、チルダの接頭辞を付けることです（例えば、~LControl up::）

source: One way to send multiple lines of text is to use a continuation section:
ja: 複数行の文章を送る方法として、継続部分を利用する方法があります：

source: One workaround is to name the hotkey's function and call it directly.
ja: 回避策としては、ホットキーの機能に名前を付けて直接呼び出す方法があります。

source: One workaround is to build a list of items to remove, then use a second loop to remove the items after the first loop completes.
ja: 回避策として、削除するアイテムのリストを作成し、最初のループが完了した後に2番目のループでアイテムを削除する方法があります。

source: One workaround is to use built-in functions which don't require window activation, such as ControlSend and ControlClick.
ja: 回避策のひとつは、ControlSendや ControlClickのような、ウィンドウのアクティブ化を必要としない組み込み関数を使うことです。

source: Only Text controls with the SS_NOTIFY (0x100) style send click and double-click notifications, so OnEvent automatically adds this style when a Click or DoubleClick callback is registered.
ja: SS_NOTIFY（0x100）スタイルを持つTextコントロールだけがクリックやダブルクリックの通知を送るので、OnEventはClickやDoubleClickコールバックが登録されると自動的にこのスタイルを追加します。

source: Only a single file can be included by this method.
ja: このメソッドでインクルードできるファイルは1つだけです。

source: Only input-capable controls which support GuiCtrl.Value and have been given a name are included.
ja: GuiCtrl.Valueをサポートし、名前が付与された入力可能なコントロールのみが含まれます。

source: Only letters, numbers, underscore and non-ASCII characters are allowed.
ja: 使用できる文字は、英字、数字、アンダースコア、非ASCII文字のみです。

source: Only one item at a time can be selected.
ja: 一度に選択できるのは1項目のみ。

source: Only one row of tabs is displayed.
ja: タブは1列のみ表示される。

source: Only syntax is checked, not semantics.
ja: チェックされるのはシンタックスだけで、セマンティクスはチェックされない。

source: Only the Any prototype itself has no base.
ja: Any原型そのものにのみベースがない。

source: Only the class name is retrieved (the prefix "ahk_class" is not included in the return value).
ja: クラス名のみが取得されます（接頭辞「ahk_class」は返り値に含まれません）。

source: Only the first 127 characters are displayed, and the text is truncated at the first tab character, if present.
ja: 最初の127文字だけが表示され、テキストは最初のタブ文字で切り捨てられる。

source: Only the first 265 characters will be displayed.
ja: 最初の265文字だけが表示されます。

source: Only the first 65,533 characters of the section are retrieved.
ja: セクションの最初の65,533文字のみが検索されます。

source: Only the first 73 characters will be displayed.
ja: 最初の73文字のみが表示されます。

source: Only the first 8190 characters of text are significant for sorting purposes (except for the Logical option, in which case the limit is 4094).
ja: テキストの最初の8190文字だけが、ソートのために重要です（Logicalオプションを除く、その場合の制限は4094文字です）。

source: Only the following choices must be made during installation:
ja: インストール時には、以下の選択のみを行う必要があります：

source: Only the main file is checked.
ja: チェックされるのはメインファイルのみ。

source: Only the most recent call to any of the HotIf functions in the current thread will be in effect.
ja: 現在のスレッドでHotIf関数のいずれかを最近呼び出したものだけが有効になります。

source: Only the naked filename (with no path) will be shown.
ja: 裸のファイル名（パスなし）のみが表示されます。

source: Only the right-most parameter can be expanded this way.
ja: この方法で拡張できるのは、一番右のパラメータだけです。

source: Only those lines of the 1st file that contain the word FAMILY will be written to the 2nd file.
ja: 1つ目のファイルのうち、FAMILYという単語を含む行だけが、2つ目のファイルに書き込まれます。

source: Open - Open the script's main window.
ja: 開く - スクリプトのメインウィンドウを開きます。

source: Open Notepad
ja: メモ帳を開く

source: Open Winspector Spy and a "New Message" window.
ja: Winspector Spyと「New Message」ウィンドウを開きます。

source: Open an image processing program such as Paint.
ja: ペイントなどの画像処理ソフトを起動します。

source: Open notepad or (anything you can type in) and press Ctrl and J.
ja: メモ帳か（入力できるものなら何でも）開いて、Ctrlと Jを押します。

source: Open templates folder:
ja: テンプレートフォルダを開きます：

source: Open templates folder: Opens the folder where user-defined templates can be stored.
ja: Open templates folder：ユーザー定義テンプレートを保存できるフォルダを開きます。

source: Open the script file to be debugged.
ja: デバッグ対象のスクリプトファイルを開きます。

source: Open the template in the default editor.
ja: デフォルトのエディタでテンプレートを開く。

source: Open the zip file using File Explorer (no extraction necessary), or extract the contents of the zip file to a temporary directory.
ja: ファイルエクスプローラーでZIPファイルを開く（解凍不要）か、ZIPファイルの中身を一時ディレクトリに展開します。

source: OpenOrProperties(ItemName, *) ; The user selected "Open" or "Properties" in the context menu.
ja: OpenOrProperties(ItemName, *) ;ユーザーがコンテキストメニューの "Open"または "Properties"を選択した。

source: Opens Ahk2Exe, or offers to automatically download and install it.
ja: Ahk2Exeを開くか、自動的にダウンロードしてインストールします。

source: Opens MS Paint and draws a little house.
ja: MS Paintを開き、小さな家を描きます。

source: Opens Notepad and pastes time/date by sending F5 while BlockInput is turned on.
ja: BlockInputをONにした状態でF5を送るとメモ帳が開き、時刻や日付を貼り付けることができます。

source: Opens Notepad and waits a maximum of 2 seconds until it is active.
ja: メモ帳を開き、アクティブになるまで最大2秒待ちます。

source: Opens Notepad and waits a maximum of 3 seconds until it exists.
ja: メモ帳を開き、存在するまで最大3秒待つ。

source: Opens Notepad minimized and send it some text.
ja: メモ帳を最小化して開き、テキストを送信します。

source: Opens Notepad, waits until it exists and maximizes it.
ja: メモ帳を開き、それが存在するまで待ち、最大化する。

source: Opens Notepad, waits until it exists and minimizes it.
ja: メモ帳を開き、それが存在するまで待ち、最小化する。

source: Opens Notepad, waits until it exists and then waits until it is closed.
ja: メモ帳を開き、それが存在するまで待ち、閉じるまで待つ。

source: Opens Notepad, waits until it exists, hides it for a short time and unhides it.
ja: メモ帳を開いてから実行されるまで待ち、短時間非表示にしてからそれを解除します。

source: Opens Notepad, waits until it is active and changes its title.
ja: メモ帳を開き、アクティブになるまで待ち、タイトルを変更する。

source: Opens a document in a maximized application and displays a custom error message on failure.
ja: 最大化されたアプリケーションでドキュメントを開き、失敗時にカスタムエラーメッセージを表示します。

source: Opens a file to read specific content from it and/or to write new content into it.
ja: ファイルを開いて、特定のコンテンツを読み込んだり、新しいコンテンツを書き込んだりします。

source: Opens an instance of Explorer at the indicated folder.
ja: 指定されたフォルダーにエクスプローラーのインスタンスを開きます。

source: Opens an instance of the Explorer's Search Companion or Find File window at the indicated folder.
ja: エクスプローラの「検索仲間」または「ファイル検索」ウィンドウのインスタンスを、指定されたフォルダーで開くことができます。

source: Opens the main window, waits until it is active and changes its title.
ja: メイン・ウィンドウを開き、アクティブになるまで待ち、タイトルを変更する。

source: Opens the Run dialog, shows its drop-down list for 2 seconds and closes the dialog.
ja: ファイル名を指定して実行」ダイアログを開き、そのドロップダウンリストを2秒間表示した後、ダイアログを閉じます。

source: Opens the calculator, waits until it exists and moves it to the upper-left corner of the screen.
ja: 電卓を開き、電卓が存在するまで待ち、画面の左上隅に移動する。

source: Opens the calculator, waits until it exists, and retrieves and reports its text.
ja: 電卓を起動して、ウィンドウが開くまで待ち、そのテキストを取得して報告します。

source: Opens the command prompt and sent it some text.
ja: コマンドプロンプトを開き、テキストを送信します。

source: Opens the current script for editing in the associated editor.
ja: 現在のスクリプトを開き、関連するエディターで編集できるようにします。

source: Opens the current script for editing in the default editor.
ja: 現在のスクリプトをデフォルトのエディターで開きます。

source: Opens the folder where user-defined templates can be stored.
ja: ユーザー定義テンプレートを保存できるフォルダを開きます。

source: Opens the indicated file (normally not needed because it is the default action for most file types).
ja: 指定されたファイルを開く（ほとんどのファイルタイプでデフォルトの動作であるため、通常は必要ありません）。

source: Opens the indicated file for editing.
ja: 指示されたファイルを編集用に開きます。

source: Opens the registry editor as administrator.
ja: レジストリエディタを管理者として開く。

source: Opens the script for editing.
ja: 編集用のスクリプトを開きます。

source: Opens the script in read-only mode and read its first line.
ja: スクリプトを読み取り専用で開き、その1行目を読み取る。

source: Operating System and User Info
ja: オペレーティング・システムとユーザー情報

source: Operating System and User Info:
ja: オペレーティングシステムとユーザー情報：

source: Operating System and User Info: A_OSVersion, A_ScreenWidth, A_ScreenHeight, (...more...)
ja: オペレーティングシステムとユーザー情報：A_OSVersion、A_ScreenWidth、A_ScreenHeight、(...もっと...)

source: Operation
ja: オペレーション

source: Operator
ja: オペレーター

source: Operators
ja: 演算子

source: Operators for Objects
ja: オブジェクトの演算子

source: Operators in Expressions
ja: 式の中での演算子

source: Operators of equal precedence such as multiply (*) and divide (/) are evaluated in left-to-right order unless otherwise specified in the operator table.
ja: 乗算（*）や除算（/）などの優先順位が等しい演算子は、演算子テーブルで特に指定がない限り、左から右の順番で評価されます。

source: Operators such as NOT/>/=/< automatically produce a true or false value:
ja: NOT/>/=/<などの演算子は、自動的に真か偽の値を生成する：

source: Operators such as NOT/>/=/< automatically produce a true or false value: they yield 1 for true and 0 for false.
ja: NOT/>/=/<などの演算子は、自動的に真か偽の値を生成します：真なら1、偽なら0となります。

source: Optimization
ja: 最適化

source: Optimize by ensuring MyVar has plenty of space to work with.
ja: MyVarに、十分なスペースを確保して最適化する。

source: Optimized ProcessGetPath, ProcessSetPriority and ProcessClose to not scan through all processes when given a valid PID, even if access to the process is denied.
ja: プロセスへのアクセスが拒否されたときでも、有効なPIDが与えられた場合に全てのプロセスをスキャンしないようにProcessGetPath関数、ProcessSetPriority関数、および ProcessClose関数を最適化しました。

source: Optimized allocation of cached COM property names for built-in IDispatch.
ja: 組み込み IDispatch 用にキャッシュされた COM プロパティ名の割り当てが最適化されました。

source: Optimized conversion of DllCall type names.
ja: DllCallの型名の変換を最適化しました。

source: Option
ja: オプション

source: Option * sets the value to true.
ja: Option*は、値をtrueに設定します。

source: Option B sets the value to false.
ja: オプションBは、値をfalseにします。

source: Option C sets the value to true.
ja: オプションCは、値をtrueにします。

source: Option I sets the value to 1 (or a given value).
ja: オプションIでは、1（または所定の値）に設定されます。

source: Option T also sets the timeout value.
ja: オプションTでは、タイムアウト値も設定します。

source: Option V sets the value to true.
ja: オプションVでは、trueに設定されます。

source: Option Properties
ja: オプションプロパティ

source: Option removal potentially not affecting the corresponding SC.
ja: オプションの削除は、対応するSCに影響を与えない可能性があります。

source: Optional Parameters
ja: オプションのパラメータ

source: Optional parameters can simply be left blank, but the delimiting comma is still required unless all subsequent parameters are also omitted.
ja: オプションのパラメータは、単に空白にすることもできますが、後続のパラメータがすべて省略されない限り、区切りカンマは必要です。

source: Optional:
ja: オプショナル：

source: Optionally enter the word verbose to output status messages to stdout as well.
ja: オプションでverboseと入力すると、ステータス・メッセージを標準出力にも出力する。

source: Optionally hides the window.
ja: オプションでウィンドウを非表示にすることができます。

source: Optionally specify one of the following values to force all values to be compared as strings:
ja: オプションで以下の値のいずれかを指定すると、すべての値が文字列として比較される：

source: Options (case-sensitive)
ja: オプション（大文字と小文字を区別）

source: Options and Styles for the Options Parameter
ja: Optionsパラメータのオプションとスタイル

source: Options are not case sensitive.
ja: オプションは、大文字と小文字を区別しません。

source: Options can be set by both virtual key code and scan code, and are accumulative.
ja: オプションは、仮想キーコードとスキャンコードの両方で設定でき、累積されます。

source: Options potentially also being applied to sc000.
ja: オプションはsc000にも適用される可能性がある。

source: Or add in some more details:
ja: あるいは、さらに詳細を加える：

source: Or look for "AutoHotkey Help File" or "AutoHotkey.chm" in the start menu or your installation directory.
ja: または、スタートメニューまたはインストールディレクトリで「AutoHotkey Help File」または「AutoHotkey.chm」を探してください。

source: Ord - Syntax & Usage | AutoHotkey v2
ja: Ord - 構文と使用法｜AutoHotkey v2

source: Ordinarily, one refers to a class object by the name given in its class definition.
ja: 通常、クラスオブジェクトは、そのクラス定義で与えられた名前で呼ばれます。

source: Originally the match object had methods instead of properties so that properties could be reserved for subpattern names.
ja: 元々、マッチオブジェクトはプロパティの代わりにメソッドを持ち、プロパティはサブパターン名のために予約できるようになっていました。

source: Other
ja: その他

source: Other Changes
ja: その他の変更点

source: Other Events
ja: その他のイベント

source: Other Examples?
ja: 他の例は？

source: Other Features
ja: その他の機能

source: Other Helpful Goodies
ja: その他の役立つグッズ

source: Other Keys
ja: その他のキー

source: Other Options
ja: その他のオプション

source: Other Useful Remappings
ja: その他の便利なリマッピング

source: Other applications are putting a heavy load on the CPU.
ja: 他のアプリケーションがCPUに大きな負荷をかけている。

source: Other built-in functions can detect them only if DetectHiddenWindows has been turned on.
ja: 他の組み込み関数は、DetectHiddenWindowsがオンになっている場合のみ検出できます。

source: Other characters such as the following are not allowed:
ja: その他、以下のような文字は使用できません：

source: Other characters such as the following are not allowed: spaces, tabs, plus signs, minus signs, decimal points, hexadecimal digits, and the 0x prefix.
ja: その他、以下のような文字は使用できません：スペース、タブ、プラス記号、マイナス記号、小数点、16進数、0xの接頭辞。

source: Other common escape sequences include `n for linefeed (Enter) and `t for tab.
ja: その他によく使われるエスケープシーケンスとして、改行（Enter）を表す`n、タブを表す`tがあります。

source: Other constructor
ja: その他のコンストラクタ

source: Other errors are raised only when specific conditions are met while the script is running.
ja: その他、スクリプトの実行中に特定の条件が満たされた場合にのみ発生するエラーもあります。

source: Other expressions can be used as the target of a function call, including double-derefs.
ja: 関数呼び出しのターゲットとして、ダブルデフを含む他の式を使用することができます。

source: Other forks of AutoHotkey may support other names.
ja: AutoHotkeyの他のフォークでは、他の名前をサポートしている場合があります。

source: Other hotkey modifier symbols are not supported by Send.
ja: その他のホットキー修飾記号は、Sendではサポートされていません。

source: Other links
ja: その他のリンク

source: Other messages are also output to stdout.
ja: その他のメッセージも標準出力に出力される。

source: Other methods:
ja: その他の方法：

source: Other out of range values may also cause a blank space where the icon would be.
ja: その他の範囲外の値でも、アイコンがあるはずの場所に空白ができることがあります。

source: Other programs or scripts can check for this directive for various purposes.
ja: 他のプログラムやスクリプトは、さまざまな目的でこのディレクティブを確認することができます。

source: Other properties and methods are inherited from Func, but do not reflect the properties of the target function or method (which is not required to be implemented as a function).
ja: その他のプロパティやメソッドはFuncから継承されるが、対象となる関数やメソッドのプロパティは反映されない（関数として実装する必要はない）。

source: Other redundant Obj functions (which mirror built-in methods of Object) were removed.
ja: その他、冗長なObj関数（Objectの組み込みメソッドをミラーリングしたもの）を削除しました。

source: Other sources of icons include the following types of files:
ja: その他、アイコンのソースとして、以下のような種類のファイルがあります：

source: Other sources of icons include the following types of files: EXE, DLL, CPL, SCR, and other types that contain icon resources.
ja: その他、アイコンのソースとして、以下のような種類のファイルがあります：EXE、DLL、CPL、SCRなど、アイコンリソースを含むタイプ。

source: Other sub-commands
ja: その他のサブコマンド

source: Other switches not normally supported by compiled scripts can be used but must be listed to the right of this switch.
ja: コンパイル済みスクリプトでは通常サポートされていないその他のスイッチも使用できるが、このスイッチの右側に記載する必要がある。

source: Other tools for AutoHotkey scripting
ja: AutoHotkeyスクリプティングのためのその他のツール

source: Other types of GUI events can be detected and acted upon via OnNotify, OnCommand or OnMessage.
ja: その他のタイプのGUIイベントは、OnNotify、OnCommand、OnMessageで検出し、対応することができます。

source: Other values are reserved for future use.
ja: その他の値は、将来の使用のために予約されています。

source: Other:
ja: その他：

source: Others
ja: その他

source: Others editors
ja: その他の編集者

source: Otherwise (that is, if Notepad does not exist):
ja: それ以外の場合（つまり、メモ帳が存在しない場合）：

source: Otherwise A_LastError contains an error code that might indicate why no files were found.
ja: それ以外の場合、A_LastError は、ファイルが見つからなかった理由を示す可能性のあるエラーコードを含みます。
